lucckb/isixrtos/libstm32/inc/stm32sdadc.h
/*
 * =====================================================================================
 *
 *       Filename:  stm32sdadc.h
 *
 *    Description:  SDADC driver
 *
 *        Version:  1.0
 *        Created:  23.10.2016 18:20:34
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Lucjan Bryndza (LB), lbryndza.p(at)boff(dot)pl
 *   Organization:  BoFF
 *
 * =====================================================================================
 */

#pragma once

#include <stm32lib.h>

#ifndef STM32MCU_MAJOR_TYPE_F37
#error SDADC perhiperal does not exist on selected platform
#endif

#define CR2_CLEAR_MASK            ((uint32_t)0xFE30FFFF)

#ifdef __cplusplus
namespace stm32 {
#endif


/**
  * @brief  Initializes the SDADCx peripheral according to the specified parameters
  *         in the SDADC_InitStruct.
  * @note   SDADC_FastConversionMode can be modified only if the SDADC is disabled
  *         or the INITRDY flag is set. Otherwise the configuration can't be modified.
  * @note   Channel selection and continuous mode configuration affect only the 
  *         regular channel.
  * @note   Fast conversion mode is regardless of regular/injected conversion mode.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_InitStruct: pointer to an SDADC_InitTypeDef structure that contains
  *         the configuration information for the specified SDADC peripheral.
  * @retval None
  */
static inline void sdadc_init(SDADC_TypeDef* SDADCx, 
		uint32_t channel, bool continous_conv_mode, bool fast_conversion_mode )
{
  uint32_t tmpcr2 = 0;


  /*---------------------------- SDADCx CR2 Configuration --------------------*/
  /* Get the SDADCx_CR2 value */
  tmpcr2 = SDADCx->CR2;

  /* Clear FAST, RCONT and RCH bits */
  tmpcr2 &= CR2_CLEAR_MASK;
  /* Configure SDADCx: continuous mode for regular conversion, 
     regular channel and fast conversion mode */
  /* Set RCONT bit according to SDADC_ContinuousConvMode value */
  /* Set FAST bit according to SDADC_FastConversionMode value */
  /* Select the regular channel according to SDADC_Channel value */
  tmpcr2 |= (uint32_t)(((uint32_t)continous_conv_mode<<22) |
                       (fast_conversion_mode<<(uint32_t)24) |
                       (channel & SDADC_CR2_RCH));

  /* Write to SDADCx_CR2 */
  SDADCx->CR2 = tmpcr2;
}



/**
  * @brief  Configures the analog input mode.
  * @note   This function can be used only if the SDADC is disabled 
  *         or the INITRDY flag is set. Otherwise the configuration can't be modified.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_AINStruct: pointer to an SDADC_AINStructTypeDef structure that contains 
  *         the analog inputs configuration information for the specified SDADC peripheral.
  * @retval None
  */
static inline void sdadc_ain_init(SDADC_TypeDef* SDADCx, uint32_t SDADC_Conf,
		uint32_t input_mode, uint32_t gain, uint32_t common_mode, uint32_t offset )
{
  uint32_t tmp = 0;


  /* Get the ASDACx address */
  tmp = (uint32_t)((uint32_t)SDADCx + 0x00000020);
  /* Get the ASDACx CONFxR value: depending SDADC_Conf, analog input configuration
     is set to CONF0R, CONF1R or CONF2R register */
  tmp = (uint32_t)(SDADC_Conf << 2) + tmp;

  /* Set the analog input configuration to the selected CONFxR register */
  *(__IO uint32_t *) (tmp) = (uint32_t) (input_mode | gain |
                                         common_mode | offset);
}


/**
  * @brief  Configures the SDADCx channel.
  * @note   SDADC channel configuration can be modified only if the SDADC is disabled
  *         or the INITRDY flag is set. Otherwise the configuration can't be modified.  
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: The SDADC injected channel.
  *          This parameter can be one of the following values:
  *            @arg SDADC_Channel_0: SDADC Channel 0 selected
  *            @arg SDADC_Channel_1: SDADC Channel 1 selected
  *            @arg SDADC_Channel_2: SDADC Channel 2 selected
  *            @arg SDADC_Channel_3: SDADC Channel 3 selected
  *            @arg SDADC_Channel_4: SDADC Channel 4 selected
  *            @arg SDADC_Channel_5: SDADC Channel 5 selected
  *            @arg SDADC_Channel_6: SDADC Channel 6 selected
  *            @arg SDADC_Channel_7: SDADC Channel 7 selected
  *            @arg SDADC_Channel_8: SDADC Channel 8 selected
  * @param  SDADC_Conf: The SDADC input configuration.
  *          This parameter can be one of the following values:
  *            @arg SDADC_Conf_0: SDADC Conf 0 selected
  *            @arg SDADC_Conf_1: SDADC Conf 1 selected
  *            @arg SDADC_Conf_2: SDADC Conf 2 selected
  * @note   The SDADC configuration (Conf 0, Conf 1, Conf 2) should be performed
  *         using SDADC_AINInit()
  * @retval None
  */
static inline void sdadc_channel_config(SDADC_TypeDef* SDADCx, 
		uint32_t SDADC_Channel, uint32_t SDADC_Conf)
{
  uint32_t channelnum = 0;


  /*----------------------- SDADCx CONFCHRx Configuration --------------------*/
  if(SDADC_Channel != SDADC_Channel_8)
  {
    /* Get channel number */
    channelnum = (uint32_t)(SDADC_Channel>>16);
    /* Set the channel configuration */
    SDADCx->CONFCHR1 |= (uint32_t) (SDADC_Conf << (channelnum << 2));
  }
  else
  {
    SDADCx->CONFCHR2 = (uint32_t) (SDADC_Conf);
  }
}



/**
  * @brief  Enables or disables the specified SDADC peripheral.
  * @note   When disabled, power down mode is entered, the flags and the data
  *         are cleared.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the SDADCx peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_cmd(SDADC_TypeDef* SDADCx, bool enabled )
{

  if ( enabled )
  {
    /* Set the ADON bit to enable the SDADC */
    SDADCx->CR2 |= (uint32_t)SDADC_CR2_ADON;
  }
  else
  {
    /* Reset the ADON bit to disable the SDADC */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_ADON);
  }
}


/**
  * @brief  Enables or disables the initialization mode for specified SDADC peripheral.
  * @note   Initialization mode should be enabled before setting the analog input
  *         configuration, the fast conversion mode, the external trigger...
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the SDADCx peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  *         When enabled, the SDADCx is in initialization mode and the SDADCx can
  *         be configured (except: power down mode, standby mode, slow clock and VREF selection).
  *         When disabled, the SDADCx isn't in initialization mode and limited
  *         configurations are allowed (regular channel selection, software trigger)
  * @retval None
  */
static inline void SDADC_InitModeCmd(SDADC_TypeDef* SDADCx, bool enabled )
{
  if ( enabled )
  {
    /* Set the INIT bit to enter initialization mode */
    SDADCx->CR1 |= (uint32_t)SDADC_CR1_INIT;
  }
  else
  {
    /* Reset the INIT bit to exit initialization mode */
    SDADCx->CR1 &= (uint32_t)(~SDADC_CR1_INIT);
  }
}


/**
  * @brief  Enables or disables the fast conversion mode for the SDADC.
  * @note   When converting a single channel in continuous mode, having enabled
  *         fast mode causes each conversion (except for the first) to execute
  *         3 times faster (taking 120 SDADC cycles rather than 360).
  *         Fast conversion mode has no meaning for conversions which are not continuous.
  * @note   fast conversion mode can be modified only if the SDADC is disabled
  *         or the INITRDY flag is set. Otherwise the configuration can't be modified.    
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC fast conversion mode
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_fast_conversion_cmd(SDADC_TypeDef* SDADCx, bool enabled )
{
  if ( enabled )
  {
    /* Enable the fast conversion mode */
    SDADCx->CR2 |= SDADC_CR2_FAST;
  }
  else
  {
    /* Disable the fast conversion mode */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_FAST);
  }
}


/**
  * @brief  Selects the reference voltage.
  * @note   The reference voltage is common to the all SDADCs (SDADC1, SDADC2 and SDADC3).
  *         The reference voltage selection is available only in SDADC1 and therefore
  *         to select the VREF for SDADC2/SDADC3, SDADC1 clock must be already enabled.
  * @note   The reference voltage selection can be performed only when the SDADC
  *         is disabled.
  * @param  SDADC_VREF: Reference voltage selection.
  *          This parameter can be one of the following values:
  *            @arg SDADC_VREF_Ext: The reference voltage is forced externally using VREF pin
  *            @arg SDADC_VREF_VREFINT1: The reference voltage is forced internally to 1.22V VREFINT
  *            @arg SDADC_VREF_VREFINT2: The reference voltage is forced internally to 1.8V VREFINT
  *            @arg SDADC_VREF_VDDA: The reference voltage is forced internally to VDDA
  * @retval None
  */
static inline void SDADC_VREFSelect(uint32_t SDADC_VREF)
{
  uint32_t tmpcr1;
  /* Get SDADC1_CR1 register value */
  tmpcr1 = SDADC1->CR1;

  /* Clear the SDADC1_CR1_REFV bits */
  tmpcr1 &= (uint32_t) (~SDADC_CR1_REFV);
  /* Select the reference voltage */
  tmpcr1 |= SDADC_VREF;

  /* Write in SDADC_CR1 */
  SDADC1->CR1 = tmpcr1;
}


/**
  * @brief  Configures the calibration sequence.
  * @note   After calling SDADC_CalibrationSequenceConfig(), use SDADC_StartCalibration()
  *         to start the calibration process.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_CalibrationSequence: Number of calibration sequence to be performed.
  *          This parameter can be one of the following values:
  *            @arg SDADC_CalibrationSequence_1: One calibration sequence will be performed
  *                                      to calculate OFFSET0[11:0] (offset that corresponds to conf0)
  *            @arg SDADC_CalibrationSequence_2: Two calibration sequences will be performed
  *                                      to calculate OFFSET0[11:0] and OFFSET1[11:0]
  *                                      (offsets that correspond to conf0 and conf1)
  *            @arg SDADC_CalibrationSequence_3: Three calibration sequences will be performed
  *                                      to calculate OFFSET0[11:0], OFFSET1[11:0], 
  *                                      and OFFSET2[11:0] (offsets that correspond to conf0, conf1 and conf2)
  * @retval None
  */
static inline void sdadc_calibration_sequence_config(SDADC_TypeDef* SDADCx, 
		uint32_t SDADC_CalibrationSequence)
{
  uint32_t tmpcr2;

  /* Get SDADC_CR2 register value */
  tmpcr2 = SDADCx->CR2;

