lucckb/isixrtos/libstm32/inc/stm32sdadc.h
  /* Clear the SDADC_CR2_CALIBCNT bits */
  tmpcr2 &= (uint32_t) (~SDADC_CR2_CALIBCNT);
  /* Set the calibration sequence */
  tmpcr2 |= SDADC_CalibrationSequence;

  /* Write in SDADC_CR2 */
  SDADCx->CR2 = tmpcr2;
}


/**
  * @brief  Launches a request to start the calibration sequence.
  * @note   use SDADC_CalibrationSequenceConfig() function to configure the 
  *         calibration sequence then call SDADC_StartCalibration() to start the 
  *         calibration process.  
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
static inline void sdadc_start_calibration(SDADC_TypeDef* SDADCx)
{
  /* Request a start of the calibration sequence */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_STARTCALIB;
}


/**
  * @brief  Selects the SDADC channel to be used for regular conversion.
  * @note   Just one channel of the 9 available channels can be selected.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: The SDADC regular channel.
  *          This parameter can be one of the following values:
  *            @arg SDADC_Channel_0: SDADC Channel 0 selected
  *            @arg SDADC_Channel_1: SDADC Channel 1 selected
  *            @arg SDADC_Channel_2: SDADC Channel 2 selected
  *            @arg SDADC_Channel_3: SDADC Channel 3 selected
  *            @arg SDADC_Channel_4: SDADC Channel 4 selected
  *            @arg SDADC_Channel_5: SDADC Channel 5 selected
  *            @arg SDADC_Channel_6: SDADC Channel 6 selected
  *            @arg SDADC_Channel_7: SDADC Channel 7 selected
  *            @arg SDADC_Channel_8: SDADC Channel 8 selected
  * @retval None
  */
static inline void sdadc_channel_select(SDADC_TypeDef* SDADCx, uint32_t SDADC_Channel)
{
	uint32_t tmpcr2;

  /* Get SDADC_CR2 register value */
  tmpcr2 = SDADCx->CR2;

  /* Clear the RCH[3:0] bits */
  tmpcr2 &= (uint32_t) (~SDADC_CR2_RCH);
  /* Select the regular channel */
  tmpcr2 |= (uint32_t) (SDADC_Channel & 0xFFFF0000);

  /* Write in SDADC_CR2 register */
  SDADCx->CR2 = tmpcr2;
}


/**
  * @brief  Enables or disables the SDADC continuous conversion mode.
  *         When enabled, the regular channel is converted repeatedly after each
  *         conversion request.
  *         When disabled, the regular channel is converted once for each
  *         conversion request.     
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC continuous conversion mode
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_continuous_mode_cmd(SDADC_TypeDef* SDADCx, bool enabled )
{
  if ( enabled )
  {
    /* Enable the selected SDADC continuous conversion mode */
    SDADCx->CR2 |= (uint32_t)SDADC_CR2_RCONT;
  }
  else
  {
    /* Disable the selected SDADC continuous conversion mode */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_RCONT);
  }
}


/**
  * @brief  Enables the selected SDADC software start conversion of the regular channels.
  * @note   If the flag SDADC_FLAG_RCIP is set or INIT bit is set, calling this
  *         function SDADC_SoftwareStartConv() has no effect.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
static inline void sdadc_software_start_conv(SDADC_TypeDef* SDADCx)
{
  /* Enable the selected SDADC conversion for regular group */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_RSWSTART;
}


/**
  * @brief  Returns the last SDADC conversion result data for regular channel.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval The Data conversion value.
  */
static inline int16_t sdadc_get_conversion_value(SDADC_TypeDef* SDADCx)
{
  /* Return the selected SDADC conversion value for regular channel */
  return (int16_t) SDADCx->RDATAR;
}


/**
  * @brief  Launches SDADC2/SDADC3 regular conversion synchronously with SDADC1.
  * @note   This feature is available only on SDADC2 and SDADC3.
  * @param  SDADCx: where x can be 2 or 3 to select the SDADC peripheral.
  *         When enabled, a regular conversion is launched at the same moment
  *         that a regular conversion is launched in SDADC1.
  *         When disabled, do not launch a regular conversion synchronously with SDADC1.
  * @retval None
  */
static inline void sdadc_regular_synchro_sdadc1(SDADC_TypeDef* SDADCx, bool en )
{
  if ( en )
  {
    /* Enable synchronization with SDADC1 on regular conversions */
    SDADCx->CR1 |= SDADC_CR1_RSYNC;
  }
  else
  {
    /* Disable synchronization with SDADC1 on regular conversions */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_RSYNC;
  }
}


/**
  * @brief  Returns the last conversion result data for regular channel of SDADC1 and SDADC2.
  *         RSYNC bit of the SDADC2 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC2.
  *         In 16-bit MSB: the regular conversion data for SDADC2.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC2 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC1 is set.    
  */
static inline uint32_t sdadc_get_conversion_sdadc12_value(void)
{
  /* Return the selected conversion value for regular channel of SDADC1 and SDADC2*/
  return (uint32_t) SDADC1->RDATA12R;
}


/**
  * @brief  Returns the last conversion result data for regular channel of SDADC1 and SDADC3.
  *         RSYNC bit of the SDADC3 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC3.
  *         In 16-bit MSB: the regular conversion data for SDADC3.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC3 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC1 is set.
  */
static inline uint32_t sdadc_get_conversion_sdadc13_value(void)
{
  /* Return the selected conversion value for regular channel of SDADC1 and SDADC3*/
  return (uint32_t) SDADC1->RDATA13R;
}


/**
  * @brief  Enables the selected SDADC software start conversion of the injected 
  *         channels.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
static inline void sdadc_software_startinjected_conv(SDADC_TypeDef* SDADCx)
{
  /* Start a conversion of the injected group of channels */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_JSWSTART;
}


/**
  * @brief  Selects the SDADC injected channel(s).
  * @note   When selected, the SDADC channel is part of the injected group
  *         By default, channel 0 is selected
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: The SDADC injected channel.
  *          This parameter can be one or any combination of the following values:
  *            @arg SDADC_Channel_0: SDADC Channel 0 selected
  *            @arg SDADC_Channel_1: SDADC Channel 1 selected
  *            @arg SDADC_Channel_2: SDADC Channel 2 selected
  *            @arg SDADC_Channel_3: SDADC Channel 3 selected
  *            @arg SDADC_Channel_4: SDADC Channel 4 selected
  *            @arg SDADC_Channel_5: SDADC Channel 5 selected
  *            @arg SDADC_Channel_6: SDADC Channel 6 selected
  *            @arg SDADC_Channel_7: SDADC Channel 7 selected
  *            @arg SDADC_Channel_8: SDADC Channel 8 selected
  * @retval None
  */
static inline void sdadc_injected_channel_select(SDADC_TypeDef* SDADCx, uint32_t SDADC_Channel)
{
  /* Select the SDADC injected channel */
  SDADCx->JCHGR = (uint32_t) (SDADC_Channel & 0x0000FFFF);
}


/**
  * @brief  Enables or disables delayed start of injected conversions
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC delay start of injected
  *         conversions. This parameter can be: ENABLE or DISABLE.
  *         When disabled, injected conversions begin as soon as possible after
  *         the request.
  *         When enabled, after a request for injected conversion the SDADC waits
  *         a fixed interval before launching the conversion.
  * @retval None
  */
static inline void sdadc_delay_start_injected_conv_cmd(SDADC_TypeDef* SDADCx, bool en )
{

  if ( en )
  {
    /* Enable delay start of injected conversions */
    SDADCx->CR2 |= (uint32_t) (SDADC_CR2_JDS);
  }
  else
  {
    /* Disable delay start of injected conversions */
    SDADCx->CR2 &= (uint32_t) ~(SDADC_CR2_JDS);
  }
}


/**
  * @brief  Enables or disables the continuous mode for injected channels for
  *         the specified SDADC
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC continuous mode
  *         on injected channels. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_injected_continuous_mode_cmd(SDADC_TypeDef* SDADCx, bool en)
{
  if (en)
  {
    /* Enable the SDADC continuous mode for injected channels */
    SDADCx->CR2 |= (uint32_t)SDADC_CR2_JCONT;
  }
  else
  {
    /* Disable the SDADC continuous mode for injected channels */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_JCONT);
  }
}


/**
  * @brief  Configures the SDADCx external trigger for injected channels conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_ExternalTrigInjecConv: specifies the SDADC trigger to start injected 
  *    conversion. This parameter can be one of the following values:
  *            @arg SDADC_ExternalTrigInjecConv_T13_CC1: Timer13 capture compare1 selected 
  *            @arg SDADC_ExternalTrigInjecConv_T14_CC1: Timer14 TRGO event selected 
  *            @arg SDADC_ExternalTrigInjecConv_T16_CC1: Timer16 TRGO event selected
  *            @arg SDADC_ExternalTrigInjecConv_T17_CC1: Timer17 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T12_CC1: Timer12 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T12_CC2: Timer12 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T15_CC2: Timer15 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T2_CC3: Timer2 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T2_CC4: Timer2 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC1: Timer3 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC2: Timer3 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC3: Timer3 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC1: Timer4 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC2: Timer4 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC3: Timer4 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC2: Timer19 capture compare2 selected 
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC3: Timer19 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC4: Timer19 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC4: Timer4 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_Ext_IT11: External interrupt line 11 event selected
  *            @arg SDADC_ExternalTrigInjecConv_Ext_IT15: External interrupt line 15 event selected
  * @retval None
  */
static inline void sdadc_external_trig_injected_conv_config(SDADC_TypeDef* SDADCx, 
		uint32_t SDADC_ExternalTrigInjecConv)
{
  uint32_t tmpreg = 0;

  /* Get the old register value */
  tmpreg = SDADCx->CR2;

  /* Clear the old external trigger selection for injected group */
  tmpreg &= (uint32_t) (~SDADC_CR2_JEXTSEL);
  /* Set the external event selection for injected group */
  tmpreg |= SDADC_ExternalTrigInjecConv;

  /* Store the new register value */
  SDADCx->CR2 = tmpreg;
}


/**
  * @brief  Configures the SDADCx external trigger edge for injected channels conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_ExternalTrigInjecConvEdge: specifies the SDADC external trigger
  *         edge to start injected conversion.
  *          This parameter can be one of the following values:
  *            @arg SDADC_ExternalTrigInjecConvEdge_None: external trigger disabled for
  *          injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_Rising: Each rising edge on the selected
  *          trigger makes a request to launch a injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_Falling: Each falling edge on the selected
  *          trigger makes a request to launch a injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_RisingFalling: Both rising edges and 
  *          falling edges on the selected trigger make requests to launch injected conversions.
  * @retval None
  */
static inline void sdadc_external_trig_injected_conv_edge_config(SDADC_TypeDef* SDADCx, 
		uint32_t SDADC_ExternalTrigInjecConvEdge)
{
  uint32_t tmpreg = 0;

  /* Get the old register value */
  tmpreg = SDADCx->CR2;

  /* Clear the old external trigger edge for injected group */
  tmpreg &= (uint32_t) (~SDADC_CR2_JEXTEN);
  /* Set the new external trigger edge for injected group */
  tmpreg |= SDADC_ExternalTrigInjecConvEdge;

  /* Store the new register value */
  SDADCx->CR2 = tmpreg;
}


/**
  * @brief  Returns the injected channel most recently converted for
  *         the specified SDADC
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval The most recently converted SDADC injected channel.
  *          This parameter can be one of the following values:
  *            @arg 0x00000001: SDADC_Channel_0 is recently converted
  *            @arg 0x00010002: SDADC_Channel_1 is recently converted
  *            @arg 0x00020004: SDADC_Channel_2 is recently converted
  *            @arg 0x00030008: SDADC_Channel_3 is recently converted
  *            @arg 0x00040010: SDADC_Channel_4 is recently converted
  *            @arg 0x00050020: SDADC_Channel_5 is recently converted
  *            @arg 0x00060040: SDADC_Channel_6 is recently converted
  *            @arg 0x00070080: SDADC_Channel_7 is recently converted
  *            @arg 0x00080100: SDADC_Channel_8 is recently converted
  */
static inline uint32_t sdadc_get_injected_channel(SDADC_TypeDef* SDADCx)
{
  uint32_t temp = 0;
  
  /* Get the injected channel most recently converted */
  temp = (uint32_t)(SDADCx->JDATAR>>16);
  temp = (uint32_t) (((uint32_t)1<<temp) | (temp<<(uint32_t)16));

  /* Returns the injected channel most recently converted */
  return (uint32_t) (temp);
}


/**
  * @brief  Returns the SDADC injected channel conversion result
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: the most recently converted SDADC injected channel.
  *          This parameter can be one of the following values:
  *            @arg 0x00000001: SDADC_Channel_0 is recently converted 
  *            @arg 0x00010002: SDADC_Channel_1 is recently converted
  *            @arg 0x00020004: SDADC_Channel_2 is recently converted
  *            @arg 0x00030008: SDADC_Channel_3 is recently converted
  *            @arg 0x00040010: SDADC_Channel_4 is recently converted
  *            @arg 0x00050020: SDADC_Channel_5 is recently converted
  *            @arg 0x00060040: SDADC_Channel_6 is recently converted
  *            @arg 0x00070080: SDADC_Channel_7 is recently converted
  *            @arg 0x00080100: SDADC_Channel_8 is recently converted
  * @retval The injected data conversion value.
  */
static inline int16_t sdadc_get_injected_conversion_value(SDADC_TypeDef* SDADCx, 
		uint32_t* SDADC_Channel)
{
  uint32_t tmp = 0;


