lucckb/isixrtos/libstm32/inc/stm32sdadc.h
  /* Get SDADC_JDATAR register */
  tmp = (uint32_t)SDADCx->JDATAR;

  /* Get the injected channel most recently converted */
   *(uint32_t*)SDADC_Channel = (uint32_t) ((uint32_t)((tmp>>8) &0xffff0000) | (((uint32_t)1<<(tmp>>24))));

  /* Returns the injected channel conversion data */
  return (int16_t) ((uint32_t)(tmp & 0x0000FFFF));
}



/**
  * @brief  Launches injected conversion synchronously with SDADC1.
  * @note   This feature is available only on SDADC2 and SDADC3.
  * @param  SDADCx: where x can be 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC synchronization with SDADC1
  *          This parameter can be: ENABLE or DISABLE.
  *         When enabled, An injected conversion is launched at the same moment
  *         that an injected conversion is launched in SDADC1.
  *         When disabled, do not launch an injected conversion synchronously with SDADC1.
  * @retval None
  */
static inline void sdadc_injected_synchro_sdadc1(SDADC_TypeDef* SDADCx, bool en )
{
  if ( en )
  {
    /* Enable synchronization with SDADC1 on injected conversions */
    SDADCx->CR1 |= SDADC_CR1_JSYNC;
  }
  else
  {
    /* Disable synchronization with SDADC1 on injected conversions */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_JSYNC;
  }
}


/**
  * @brief  Returns the last conversion result data for injected channel of SDADC1 and SDADC2.
  *         JSYNC bit of the SDADC2 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC2.
  *         In 16-bit MSB: the regular conversion data for SDADC2.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC2 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC1 is set.    
  */
static inline uint32_t sdadc_get_injected_conversion_sdadc12_value(void)
{
  /* Return the selected conversion value for injected channel of SDADC1 and SDADC2*/
  return (uint32_t) SDADC1->JDATA12R;
}

/**
  * @brief  Returns the last conversion result data for injected channel of SDADC1 and SDADC3.
  *         JSYNC bit of the SDADC3 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC3.
  *         In 16-bit MSB: the injected conversion data for SDADC3.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC3 is set.  
  *         In 16-bit LSB: the injected conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC1 is set.
  */
static inline uint32_t sdadc_get_injected_conversion_sdadc13_value(void)
{
  /* Return the selected conversion value for injected channel of SDADC1 and SDADC3*/
  return (uint32_t) SDADC1->JDATA13R;
}


/**
  * @brief  Enables or disables the SDADC power down mode when idle.
  * @note   SDADC power down mode when idle is used to cut the consumption when
  *         the SDADC is not converting (when idle).
  * @note   When the SDADC is in power down mode and a conversion is requested, 
  *         the SDADC takes 100us to stabilize before launching the conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC power down mode when idle
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_power_down_cmd(SDADC_TypeDef* SDADCx, bool en )
{
  if ( en )
  {
    /* Enable the SDADC power-down when idle */
    SDADCx->CR1 |= SDADC_CR1_PDI;
  }
  else
  {
    /* Disable the SDADCx power-down when idle */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_PDI;
  }
}


/**
  * @brief  Enables or disables the SDADC standby mode when idle.
  * @note   SDADC standby mode when idle is used to cut the consumption when
  *         the SDADC is not converting (when idle).
  * @note   When the SDADC is in standby mode and a conversion is requested, 
  *         the SDADC takes 50us to stabilize before launching the conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC standby mode when idle
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_standby_cmd(SDADC_TypeDef* SDADCx, bool en )
{
  if ( en )
  {
    /* Enable the standby mode when idle */
    SDADCx->CR1 |= SDADC_CR1_SBI;
  }
  else
  {
    /* Disable the standby mode when idle */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_SBI;
  }
}


/**
  * @brief  Enables or disables the SDADC in slow clock mode.
  * @note   Slow clock mode (where the SDADC clock frequency should be 1.5MHz)
  *         allowing a lower level of current consumption as well as operation
  *         at a lower minimum voltage.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC slow clock mode
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void sdadc_slow_clock_cmd(SDADC_TypeDef* SDADCx, bool en )
{
  if ( en )
  {
    /* Enable the slow clock mode */
    SDADCx->CR1 |= SDADC_CR1_SLOWCK;
  }
  else
  {
    /* Disable the slow clock mode */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_SLOWCK;
  }
}


/**
  * @brief  Configures the DMA transfer for regular/injected conversions.  
  * @note   DMA requests can't be enabled for both regular and injected conversions.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_DMATransfer: Specifies the SDADC DMA transfer.
  *          This parameter can be one of the following values:
  *          @arg SDADC_DMATransfer_Regular: When enabled, DMA manages reading the 
  *          data for the regular channel.
  *          @arg SDADC_DMATransfer_Injected: When enabled, DMA manages reading the
  *          data for the injected channel.
  * @param  NewState Indicates the new state of the SDADC DMA interface.
  *           This parameter can be: ENABLE or DISABLE.  
  * @retval None
  */
static inline void sdadc_dma_config(SDADC_TypeDef* SDADCx, uint32_t SDADC_DMATransfer, bool en )
{
  if ( en )
  {
    /* Enable the DMA transfer */
    SDADCx->CR1 |= SDADC_DMATransfer;
  }
  else
  {
    /* Disable the DMA transfer */
    SDADCx->CR1 &= (uint32_t)(~SDADC_DMATransfer);
  }
}


/**
  * @brief  Enables or disables the specified SDADC interrupts.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt sources to be enabled or disabled. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration interrupt
  *            @arg SDADC_IT_JEOC: End of injected conversion interrupt
  *            @arg SDADC_IT_JOVR: Injected conversion overrun interrupt
  *            @arg SDADC_IT_REOC: End of regular conversion interrupt
  *            @arg SDADC_IT_ROVR: Regular conversion overrun interrupt
  * @param  NewState: new state of the specified SDADC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void SDADC_ITConfig(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT, bool en )
{
  if ( en )
  {
    /* Enable the selected SDADC interrupts */
    SDADCx->CR1 |= SDADC_IT;
  }
  else
  {
    /* Disable the selected SDADC interrupts */
    SDADCx->CR1 &= ((uint32_t)~SDADC_IT);
  }
}


/**
  * @brief  Checks whether the specified SDADC flag is set or not.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_FLAG: specifies the flag to check. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_FLAG_EOCAL: End of calibration flag
  *            @arg SDADC_FLAG_JEOC: End of injected conversion flag
  *            @arg SDADC_FLAG_JOVR: Injected conversion overrun flag
  *            @arg SDADC_FLAG_REOC: End of regular conversion flag
  *            @arg SDADC_FLAG_ROVR: Regular conversion overrun flag
  *            @arg SDADC_FLAG_CALIBIP:Calibration in progress status flag
  *            @arg SDADC_FLAG_JCIP: Injected conversion in progress status flag
  *            @arg SDADC_FLAG_RCIP: Regular conversion in progress status flag
  *            @arg SDADC_FLAG_STABIP: Stabilization in progress status flag
  *            @arg SDADC_FLAG_INITRDY: Initialization mode is ready
  * @retval The new state of SDADC_FLAG (SET or RESET).
  */
static inline bool sdadc_get_flag_status(SDADC_TypeDef* SDADCx, uint32_t SDADC_FLAG)
{
  /* Check the status of the specified SDADC flag */
  return ((SDADCx->ISR & SDADC_FLAG) != (uint32_t)0);
}


/**
  * @brief  Clears the SDADCx pending flags.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_FLAG: specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg SDADC_FLAG_EOCAL: End of calibration flag
  *            @arg SDADC_FLAG_JOVR: Injected conversion overrun flag
  *            @arg SDADC_FLAG_ROVR: Regular conversion overrun flag
  * @retval None
  */
static inline void sdadc_clear_flag(SDADC_TypeDef* SDADCx, uint32_t SDADC_FLAG)
{
  /* Clear the selected SDADC flags */
  SDADCx->CLRISR |= (uint32_t)SDADC_FLAG;
}


/**
  * @brief  Checks whether the specified SDADC interrupt has occurred or not.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration flag 
  *            @arg SDADC_IT_JEOC: End of injected conversion flag
  *            @arg SDADC_IT_JOVR: Injected conversion overrun flag
  *            @arg SDADC_IT_REOC: End of regular conversion flag
  *            @arg SDADC_IT_ROVR: Regular conversion overrun flag
  * @retval The new state of SDADC_IT (SET or RESET).
  */
static inline bool sdadc_get_it_status(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT)
{
  uint32_t itstatus , enablestatus ;
  /* Get the SDADC interrupt pending status */
  itstatus = (uint32_t) (SDADC_IT & SDADCx->ISR);
  /* Get the SDADC IT enable bit status */
  enablestatus = (SDADCx->CR1 & (uint32_t)SDADC_IT);

  /* Check the status of the specified SDADC interrupt */
  return ((itstatus != (uint32_t)RESET) && (enablestatus != (uint32_t)0));
}


/**
  * @brief  Clears the SDADCx interrupt pending bits.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration flag 
  *            @arg SDADC_IT_JOVR: Injected conversion overrun flag
  *            @arg SDADC_IT_ROVR: Regular conversion overrun flag
  * @retval None
  */
static inline void sdadc_clear_it_pending_bit(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT)
{
  /* Clear the selected SDADC interrupt pending bits */
  SDADCx->CLRISR |= (uint32_t)SDADC_IT;
}


#ifdef __cplusplus
}
#endif

#undef CR2_CLEAR_MASK
